In [1]:
import numpy as np
import pandas as pd
date = pd.read_csv('orders.csv')
time = pd.read_csv('messages.csv')

In [2]:
date.drop(columns=['product_id','city_id','orders'],inplace=True)
date.sample(5)

           date
416  2019-08-02
421  2019-07-05
489  2018-12-02
193  2019-05-18
515  2019-06-22

In [3]:
time.sample(5)

                    date                                                msg
745  2013-09-28 00:35:00        ласковая кошечка ищет своего ночного котика
985  2016-01-18 23:39:00  НЕ БЕДНЫЙ  НО ВРЕДНЫЙ П29  ИЩЕТ МИЛУЮ ДЕВ. ДЛЯ...
172  2013-12-06 23:57:00  всем привет забыл написать я парень ищу девушк...
415  2012-04-01 23:52:00                          А говорите могем. КУБАСОВ
100  2013-02-25 00:11:00          П+П20-25 лет пишите звоните:-).0937457784

In [4]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
dtypes: object(1)
memory usage: 7.9+ KB

# Working with Dates

In [5]:
date['date']=pd.to_datetime(date['date'])
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 7.9 KB

#### 1. Extract year

In [6]:
date['date-year']=date['date'].dt.year
date

          date  date-year
0   2019-12-10       2019
1   2018-08-15       2018
2   2018-10-23       2018
3   2019-08-17       2019
4   2019-01-06       2019
..         ...        ...
995 2018-10-08       2018
996 2018-12-06       2018
997 2019-05-07       2019
998 2019-03-03       2019
999 2019-10-15       2019

[1000 rows x 2 columns]

#### 2. Extract Month

In [7]:
date['date_month_name'] = date['date'].dt.month_name()
date['date_month_no'] = date['date'].dt.month
date.head()

        date  date-year date_month_name  date_month_no
0 2019-12-10       2019        December             12
1 2018-08-15       2018          August              8
2 2018-10-23       2018         October             10
3 2019-08-17       2019          August              8
4 2019-01-06       2019         January              1

#### 3. Extract Days

In [8]:
date['date_day'] = date['date'].dt.day
date['date_name'] = date['date'].dt.day_name()
date['date_dow'] = date['date'].dt.dayofweek
date.head()

,date,date-year,date_month_name,date_month_no,date_day,date_name,date_dow
0,2019-12-10,2019,December,12,10,Tuesday,1
1,2018-08-15,2018,August,8,15,Wednesday,2
2,2018-10-23,2018,October,10,23,Tuesday,1
3,2019-08-17,2019,August,8,17,Saturday,5
4,2019-01-06,2019,January,1,6,Sunday,6

#### 4. Extract week of the year

In [9]:
date['date_week'] = date['date'].dt.isocalendar().week
date.head(5)

,date,date-year,date_month_name,date_month_no,date_day,date_name,date_dow,date_week
0,2019-12-10,2019,December,12,10,Tuesday,1,50
1,2018-08-15,2018,August,8,15,Wednesday,2,33
2,2018-10-23,2018,October,10,23,Tuesday,1,43
3,2019-08-17,2019,August,8,17,Saturday,5,33
4,2019-01-06,2019,January,1,6,Sunday,6,1

#### 5. Extract Time elapsed between dates

In [10]:
import datetime

today = datetime.datetime.today()

today

datetime.datetime(2024, 10, 24, 20, 17, 31, 617804)

In [11]:
today - date['date']

0     1780 days 20:17:31.617804
1     2262 days 20:17:31.617804
2     2193 days 20:17:31.617804
3     1895 days 20:17:31.617804
4     2118 days 20:17:31.617804
                 ...
995   2208 days 20:17:31.617804
996   2149 days 20:17:31.617804
997   1997 days 20:17:31.617804
998   2062 days 20:17:31.617804
999   1836 days 20:17:31.617804
Name: date, Length: 1000, dtype: timedelta64[ns]

In [12]:
(today - date['date']).dt.days

0      1780
1      2262
2      2193
3      1895
4      2118
       ...
995    2208
996    2149
997    1997
998    2062
999    1836
Name: date, Length: 1000, dtype: int64

In [13]:
# Months passed
## Allowed units are 'W', 'D', 'h', 'm', 's', 'ms', 'us', 'ns'
np.round((today -date['date']) / np.timedelta64(1, 'W'),0)

0      254.0
1      323.0
2      313.0
3      271.0
4      303.0
       ...
995    316.0
996    307.0
997    285.0
998    295.0
999    262.0
Name: date, Length: 1000, dtype: float64

# Extract The Time

In [14]:
time.drop(columns=['msg'],inplace=True)
time

                    date
0    2013-12-15 00:50:00
1    2014-04-29 23:40:00
2    2012-12-30 00:21:00
3    2014-11-28 00:31:00
4    2013-10-26 23:11:00
..                   ...
995  2012-03-16 00:50:00
996  2014-01-23 23:14:00
997  2012-10-15 23:37:00
998  2012-06-21 23:34:00
999  2014-06-19 23:25:00

[1000 rows x 1 columns]

In [15]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
dtypes: object(1)
memory usage: 7.9+ KB

In [16]:
time['date']=pd.to_datetime(time['date'])

In [17]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 7.9 KB

In [18]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second
time['time'] = time['date'].dt.time
time['date_fromtimedate'] = time['date'].dt.date


time

                   date  hour  min  sec      time date_fromtimedate
0   2013-12-15 00:50:00     0   50    0  00:50:00        2013-12-15
1   2014-04-29 23:40:00    23   40    0  23:40:00        2014-04-29
2   2012-12-30 00:21:00     0   21    0  00:21:00        2012-12-30
3   2014-11-28 00:31:00     0   31    0  00:31:00        2014-11-28
4   2013-10-26 23:11:00    23   11    0  23:11:00        2013-10-26
..                  ...   ...  ...  ...       ...               ...
995 2012-03-16 00:50:00     0   50    0  00:50:00        2012-03-16
996 2014-01-23 23:14:00    23   14    0  23:14:00        2014-01-23
997 2012-10-15 23:37:00    23   37    0  23:37:00        2012-10-15
998 2012-06-21 23:34:00    23   34    0  23:34:00        2012-06-21
999 2014-06-19 23:25:00    23   25    0  23:25:00        2014-06-19

[1000 rows x 6 columns]